Revit 2027 API
IndexStreamPoint.AddPoint Method
 Inserts a IndexPoint into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddPoint(
	IndexPoint point
)
Public Sub AddPoint (
	point As IndexPoint
)
public:
void AddPoint(
	IndexPoint^ point
)
member AddPoint :
        point : IndexPoint -> unit
Parameters
point IndexPoint
 The point to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
IndexStreamPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace